tests/integration/cassettes/TestInvoicePayment.test_update.json

{
  "http_interactions": [
    {
      "recorded_at": "2022-04-17T06:52:33",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"date\": \"2019-12-31\", \"invoice_id\": 2229491, \"paid_total\": 1, \"currency\": \"EUR\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "81"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.25.1"
          ]
        },
        "method": "POST",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments"
      },
      "response": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"id\":1374480,\"date\":\"2019-12-31\",\"invoice\":{\"id\":2229491,\"identifier\":\"R220007\",\"title\":\"TestInvoicePayment.get_invoice\"},\"paid_total\":1.0,\"paid_total_in_account_currency\":1.0,\"currency\":\"EUR\",\"created_at\":\"2022-04-17T06:52:33Z\",\"updated_at\":\"2022-04-17T06:52:33Z\"}"
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Sun, 17 Apr 2022 06:52:33 GMT"
          ],
          "Etag": [
            "W/\"50810000e12aa8a9578ecf044569d19d\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Transfer-Encoding": [
            "chunked"
          ],
          "Vary": [
            "Origin"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "116796b1-8adc-455c-b479-66233fbd2d67"
          ],
          "X-Runtime": [
            "0.056497"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments"
      }
    },
    {
      "recorded_at": "2022-04-17T06:52:33",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"date\": \"2020-01-02\", \"paid_total\": 200, \"currency\": \"EUR\"}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "60"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.25.1"
          ]
        },
        "method": "PUT",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments/1374480"
      },
      "response": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"id\":1374480,\"date\":\"2020-01-02\",\"invoice\":{\"id\":2229491,\"identifier\":\"R220007\",\"title\":\"TestInvoicePayment.get_invoice\"},\"paid_total\":200.0,\"paid_total_in_account_currency\":200.0,\"currency\":\"EUR\",\"created_at\":\"2022-04-17T06:52:33Z\",\"updated_at\":\"2022-04-17T06:52:33Z\"}"
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Sun, 17 Apr 2022 06:52:33 GMT"
          ],
          "Etag": [
            "W/\"48f9e698cdc52f67f876203c5d5f7bd1\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Transfer-Encoding": [
            "chunked"
          ],
          "Vary": [
            "Origin"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "6eb1c34a-831a-4d90-bc29-641470f55e48"
          ],
          "X-Runtime": [
            "0.047216"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments/1374480"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}